src/InformationRegisters/СообщенияПроцессаВозвратаОтПокупателяДляСайта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СообщенияПроцессаВозвратаОтПокупателяДляСайта</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АктРассмотренияВозврата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктРассмотренияВозврата</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопСведения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСообщенийПроцессаВозвратовДляСайта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыСообщенийПроцессаВозвратовДляСайта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыСообщенийПроцессаВозвратовДляСайта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РезультатЗагрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаФайла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстовоеСообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаАктаВозврата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/СообщенияПроцессаВозвратаОтПокупателяДляСайта/Ext/ManagerModule.bsl
Процедура Добавить(ПараметрыСообщения, РегистрироватьКВыгрузке = Истина) Экспорт
	
	МЗ = РегистрыСведений.СообщенияПроцессаВозвратаОтПокупателяДляСайта.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ, ПараметрыСообщения,,"ДопСведения");
	МЗ.Период = ТекущаяДата();
	МЗ.Идентификатор = Строка(Новый УникальныйИдентификатор);
	МЗ.ДопСведения = Новый ХранилищеЗначения(ПараметрыСообщения.ДопСведения, Новый СжатиеДанных(9)); 
	МЗ.Записать();
	
	Если РегистрироватьКВыгрузке Тогда
		ЗарегистрироватьКВыгрузке(МЗ.Идентификатор, МЗ.Период);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьКВыгрузке(Идентификатор, Период) Экспорт
	
	Узел = ПланыОбмена.ОбменПартКом83_Сайт_Возвраты.Узел(Ложь);
	
	Если ЗначениеЗаполнено(Узел) Тогда
		
		НЗ = РегистрыСведений.СообщенияПроцессаВозвратаОтПокупателяДляСайта.СоздатьНаборЗаписей();
		НЗ.Отбор.Идентификатор.Установить(Идентификатор, Истина);
		НЗ.Отбор.Период.Установить(Период, Истина);
		НЗ.Прочитать();
		
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, НЗ);
		
	Иначе
		
		ВызватьИсключение "Не определен исходящий узел обмена для плана обмена ""ОбменПартКом83_Сайт_Возвраты""!";
		
	КонецЕсли;
	
КонецПроцедуры

Функция СтруктураПараметровСообщения() Экспорт
	
	Возврат Новый Структура("ТипСообщения, Штрихкод, АктРассмотренияВозврата, Сообщение, ДопСведения", 
	Перечисления.ТипыСообщенийПроцессаВозвратовДляСайта.ТекстовоеСообщение,,,,Новый Структура);	
	
КонецФункции
